{"doc_id":"pep-0008","title":"Style Guide for Python Code","text":"Defines widely used conventions for writing readable Python code, including naming conventions, formatting guidelines, and recommendations for comments and docstrings.","source":"https://peps.python.org/pep-0008/"}
{"doc_id":"pep-0020","title":"The Zen of Python","text":"A collection of aphorisms that capture Python’s design philosophy, emphasizing readability, simplicity, explicitness, and pragmatic tradeoffs.","source":"https://peps.python.org/pep-0020/"}
{"doc_id":"pep-0257","title":"Docstring Conventions","text":"Specifies conventions for writing docstrings, including one-line vs multi-line structure, summary line expectations, and stylistic guidance to support tooling and readability.","source":"https://peps.python.org/pep-0257/"}
{"doc_id":"pep-0440","title":"Version Identification and Dependency Specification","text":"Standardizes Python package versioning semantics (e.g., pre-releases, post-releases, dev releases) and how versions should be compared for dependency resolution.","source":"https://peps.python.org/pep-0440/"}
{"doc_id":"pep-0484","title":"Type Hints","text":"Introduces a standard syntax and ecosystem conventions for optional static typing in Python, including annotations, generics, and expectations for type checkers.","source":"https://peps.python.org/pep-0484/"}
{"doc_id":"pep-0517","title":"A build-system independent format for source trees","text":"Defines a standard, backend-agnostic interface (hooks) for building Python distributions, enabling frontends to build wheels/sdists without hard-coding a specific build system.","source":"https://peps.python.org/pep-0517/"}
{"doc_id":"pep-0518","title":"Specifying Minimum Build System Requirements for Python Projects","text":"Introduces declaring build-system requirements (e.g., build backend and dependencies) in pyproject.toml so tools can install what’s needed to build a project reliably.","source":"https://peps.python.org/pep-0518/"}
{"doc_id":"pep-0621","title":"Storing project metadata in pyproject.toml","text":"Standardizes how core project metadata (name, version, dependencies, entry points, etc.) should be represented in pyproject.toml for consistent tooling across the ecosystem.","source":"https://peps.python.org/pep-0621/"}
{"doc_id":"pep-0622","title":"Structural Pattern Matching","text":"Proposes structural pattern matching for Python, describing match/case syntax, pattern forms, binding rules, and semantics for matching on object structure.","source":"https://peps.python.org/pep-0622/"}
{"doc_id":"pep-0701","title":"Syntactic formalization of f-strings","text":"Formalizes f-string syntax to simplify parsing and maintenance, tightening the language specification and reducing special-case handling in implementations.","source":"https://peps.python.org/pep-0701/"}
